In [1]:
import pandas as pd

In [2]:
data_file = 'https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv'

In [3]:
ufos = pd.read_csv(data_file)

In [4]:
ufos.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [15]:
ufos.columns  # use this to just see the column names

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

## Method 1 for renaming columns
Useful for renaming specific columns.

In [30]:
ufos.rename(columns={'Colors Reported': 'Colors_Reported',
                     'Shape Reported': 'Shape_Reported'},
                     inplace=True)

In [14]:
ufos.head()

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## Method 2 for renaming columns
Useful for renaming all the column names.

In [18]:
ufos_new_cols = ['city', 'colors_reported', 'shape_reported', 'state', 'time']

In [19]:
ufos.columns = ufos_new_cols

In [20]:
ufos.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## Method 3 for renaming columns
Useful when reading in a file.

In [21]:
ufos = pd.read_csv(data_file,
                   names=ufos_new_cols,
                   header=0)

In [22]:
ufos.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## Method 4 for renaming columns (spaces -> underscores)
Useful at any time to replace spaces with underscores.

In [25]:
ufos = pd.read_csv(data_file)

In [26]:
ufos.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [27]:
ufos.columns = ufos.columns.str.replace(' ', '_')

In [28]:
ufos.head()

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00